magento/magento-connector/magento-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/magento/api_deleteCustomerAddress_negative.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:urn="urn:Magento">
   <soapenv:Header/>
   <soapenv:Body>
        <urn:customerAddressDelete soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <sessionId>%s(sessionId)</sessionId>
         <addressId>-1</addressId>
        </urn:customerAddressDelete>
   </soapenv:Body>
</soapenv:Envelope>