magento/magento-connector/magento-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/magento/api_updateCustomerAddress_negative.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:urn="urn:Magento">
   <soapenv:Header/>
   <soapenv:Body>
        <urn:customerAddressUpdate soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <sessionId>%s(sessionId)</sessionId>
         <addressId>-1</addressId>
            <addressData>
               <city>Colombo</city>
               <company>Virtusa</company>
               <country_id>US</country_id>
               <firstname>Jane</firstname>
               <lastname>Doe</lastname>
               <postcode>12000</postcode>
               <street><string>Arcata Main Street</string></street>
               <telephone>94715837733</telephone>
            </addressData>
        </urn:customerAddressUpdate>
   </soapenv:Body>
</soapenv:Envelope>
